[
  {
    "Id": "1463249",
    "ThreadId": "651321",
    "Html": "hi, i was trying to merge multiple pdfs generated by my script and i've found an exception thrown while writing the output.\r<br />\nNow the output file is looking good, it has all the pages from single files but i still get a fatal exception without any information on what's going wrong.\r<br />\nI worked around that by commenting line 124 of PDFMerger.php<br />\n<pre><code>throw new exception(&quot;Error outputting PDF to '$outputmode'.&quot;);</code></pre>\n\nI know that is an AWFUL programming practice but i can't find a proper documentation for fpdi-&gt;Output() to test return values and i have deadlines so can't spend all the time debugging something that seems to work properly. Is there anyone who have a clue on how getting a &quot;verbose&quot; exception to get there and fix the issue properly?<br />\n",
    "PostedDate": "2016-02-15T06:19:04.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1463255",
    "ThreadId": "651321",
    "Html": "I've dug a little bit more and found an answer: the issue seems to be a logical bug in your project in PDFMerger.php near<br />\n<pre><code>if($fpdi-&gt;Output($outputpath, $mode))\n            {\n                return true;\n            }\n            else\n            {\n                throw new exception(&quot;Error outputting PDF to '$outputmode'.&quot;);\n                return false;\n            }</code></pre>\n\nYou test the return values of fpdi-&gt;Output which according to some documentation i found is a void function, so it's always false and throws an Exception all the times.\r<br />\nI'm manually fixing it by removing/commenting the code but i suggest you to fix it in the main branch for everyone to get it working properly.\r<br />\n<br />\nWaiting for feedback, hope to have been of some help.<br />\n",
    "PostedDate": "2016-02-15T06:37:54.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]